Revit 2027 API
SpecUtils.GetAllSpecs Method
 Gets the identifiers of all specs.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static IList<ForgeTypeId> GetAllSpecs()
Public Shared Function GetAllSpecs As IList(Of ForgeTypeId)
public:
static IList<ForgeTypeId^>^ GetAllSpecs()
static member GetAllSpecs : unit -> IList<ForgeTypeId>
Return Value
IList<ForgeTypeId>
 The spec identifiers.
See Also
Reference
SpecUtils Class
Autodesk.Revit.DB Namespace